*&---------------------------------------------------------------------*
*& Module Pool      SAPMZD3SD8009
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
************************************************************************
* 최대 조회 건수
INCLUDE zd3sd0009top                           .  " FORM-Routines
INCLUDE zd3ss0009cls                            .  " FORM-Routines
INCLUDE zd3sd0009o01                            .  " FORM-Routines
INCLUDE zd3sd0009i01                            .  " FORM-Routines
INCLUDE zd3sd0009f01                            .  " FORM-Routines
