*&---------------------------------------------------------------------*
*& Include          ZD3SD0009O01
*&---------------------------------------------------------------------*
*&---------------------------------------------------------------------*
*& Module STATUS_0100 OUTPUT
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
MODULE status_0100 OUTPUT.

  gv_title = sy-title.

  SET PF-STATUS 'S0100'.
  SET TITLEBAR 'T0100' WITH gv_title.

  " DB에 저장할 데이터가 없을 때 알려주기 위해 세팅
  " 데이터가 없으면 false로 바뀜
  gv_not_initail = abap_true.


ENDMODULE.
*&---------------------------------------------------------------------*
*& Module INIT_ALV_0100 OUTPUT
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
MODULE init_alv_0100 OUTPUT.

  IF go_container IS INITIAL.

    PERFORM create_object.

    PERFORM set_layout.

    PERFORM set_fieldcat.

    PERFORM set_handler_event.

    PERFORM display_alv_0100.

  ELSE.
    PERFORM refresh_alv_0100.
  ENDIF.

ENDMODULE.
*&---------------------------------------------------------------------*
*& Module STATUS_0200 OUTPUT
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
MODULE status_0200 OUTPUT.
  SET PF-STATUS 'S0200'.
  SET TITLEBAR 'T0200' WITH TEXT-t01.
ENDMODULE.
*&---------------------------------------------------------------------*
*& Module SET_ALV_0100 OUTPUT
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
MODULE set_alv_0100 OUTPUT.

  " 리스트박스 세팅
  PERFORM set_type_list_0100.

  " 검색조건 초기 세팅
  PERFORM set_search_opt.


ENDMODULE.
*&---------------------------------------------------------------------*
*& Module SET_ALV_0200 OUTPUT
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
MODULE set_alv_0200 OUTPUT.



  " 전표에 보낼 데이터 목록(gt_delivery_item)에 데이터를 가져오기 위한 로직
  PERFORM select_delivery_item_data.

  " 전표에 보낼 데이터를 준비하기 위한 로직
  PERFORM set_alv_data_0200.

  " 스크린에 보일 Fixed Value의 Desctiption을 가져오기 위한 로직
  PERFORM get_description_0200.


  " ALV에 보여줄 ITAB에 데이터 옮기는 로직
  PERFORM move_to_gt_display2.



ENDMODULE.
*&---------------------------------------------------------------------*
*& Module INIT_ALV_0200 OUTPUT
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
MODULE init_alv_0200 OUTPUT.
  IF go_container2 IS INITIAL.

    PERFORM create_object_0200.

    PERFORM set_layout_0200.

    PERFORM set_fieldcat_0200.

    PERFORM set_handler_event_0200.

    PERFORM display_alv_0200.

  ELSE.
    PERFORM refresh_alv_0200.
  ENDIF.
ENDMODULE.
*&---------------------------------------------------------------------*
*& Module CLEAR_OK_CODE OUTPUT
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
MODULE clear_ok_code OUTPUT.


  CLEAR ok_code.

ENDMODULE.
*&---------------------------------------------------------------------*
*& Module SET_TABSTRIP_0200 OUTPUT
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
MODULE set_tabstrip_0200 OUTPUT.

  IF tab-activetab IS INITIAL.
    tab-activetab = 'FC1'.
  ENDIF.

  CASE tab-activetab.
    WHEN 'FC1'.
      gv_subscreen = '0201'.
    WHEN 'FC2'.
      gv_subscreen = '0202'.

    WHEN OTHERS.
      gv_subscreen = '0201'.

  ENDCASE.

ENDMODULE.
*&---------------------------------------------------------------------*
*& Module SET_ALV_0201 OUTPUT
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
MODULE set_alv_0201 OUTPUT.

  " 스크린에 보일 고객 정보를 가져오기 위한 로직
  PERFORM select_customer_data.

ENDMODULE.
*&---------------------------------------------------------------------*
*& Module STATUS_0201 OUTPUT
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
MODULE status_0201 OUTPUT.

ENDMODULE.
*&---------------------------------------------------------------------*
*& Module INIT_ALV_0202 OUTPUT
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
MODULE init_alv_0202 OUTPUT.

  PERFORM select_delivery_data.

  PERFORM create_icon.

ENDMODULE.
