*&---------------------------------------------------------------------*
*& Module Pool      SAPMZD3SD0008
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
* 새로 생성된 자재에 대해 SOP 서치헬프 바로 반영되게?
* SOP 서치헬프 보여줄 필드 다시 생각해보기



INCLUDE zd3sd0008top                            .  " Global Data
INCLUDE zd3sd0008cls                            .
INCLUDE zd3sd0008o01                            .  " PBO-Modules
INCLUDE zd3sd0008i01                            .  " PAI-Modules
INCLUDE zd3sd0008f01                            .  " FORM-Routines
